


var tags = {
    "카시오페아" : ["동방신기","유노윤호","최강창민", "cassiopeia","유노","윤호","최강","창민"],
    "아미" : ["방탄소년단","랩몬스터","슈가","진","제이홉","지민","뷔","정곡","army"],
    "뷰티" : ["비스트","윤두준","양요섭","이기광","용준형","손동운","beauty"],
    "브이아이피" : ["빅뱅","G-DRAGON","태양","T.O.P","대성","승리","v.i.p","vip"],
    "점핑보아" : ["보아","jumpingboa"],
    "소원" : ["소녀시대","태연","써니","티파니","효연","유리","수영","윤아","서현","hope"],
    "인스피릿" : ["인피니트","김성규","장동우","남우현","호야","이성열","엘","이성종","inspirit"],
    "유애나" : ["아이유","iu"],
    "바나" : ["비원에이포","산들","바로","진영","신우","공찬","bana"],
    "핑크팬더" : ["에이핑크","박초롱","윤보미","정은지","손나은","김남주","오하영","pink panda"],




    "비비씨" : ["블락비","지코","태일","재효","비범","피오","박경","유권","bbc"],
    "엘프" : ["슈퍼주니어","이특","희철","예성","강인","려욱","규현","시원","은혁","동해","신동","성민","한경","elf","e.l.f"],
    "별빛" : ["빅스","라비","켄","레오","홍빈","엔","혁","star light"],
    "엑소엘" : ["엑소","수호","찬열","카이","디오","백현","세훈","시우민","레이","첸","타오","루한","크리스","exo-l","exo"],
    "핫티스트" : ["투피엠","JUN. K","닉쿤","택연","우영","준호","찬성","hot test", "hottest"],
    "멜로디" : ["비투비","서은광","이민혁","이창섭","임현식","프니엘","정일훈","육성재","melody"],
    "락인" : ["버즈","김예준","윤우현","신준기","손성희","민경훈","lock in"],
    "베이비" : ["비에이피","방용국","힘찬","대현","영재","종업","젤로","baby"],
    "샤이니월드" : ["샤이니","온유","종현","Key","민호","태민","shinee World","shinee"],
    "엔젤" : ["틴탑","캡","니엘","리키","엘조","창조","천지","angel"],
    "데이지" : ["걸스데이","소진","유라","민아","혜리", "dais"],





    "프리마돈나" : ["FT아일랜드","최종훈","이홍기","이재진","최민환","송승현","primadonna"],
    "원더풀" : ["원더걸스","유빈","예은","선미","혜림","wonderful"],
    "무무" : ["마마무","솔라","문별","휘인","화사"],
    "에이플러스" : ["엠블랙","승호","지오","미르","a+", "a plus"],
    "블랙잭" : ["투애니원","박봄","박산다라","씨엘","black Jack"],
    "Clup H.O.T." : ["HOT","강타","문희준","장우혁","토니안","이재원"],
    "퍼플오션" : ["성시경","purple ocean"],
    "미유" : ["에프엑스","빅토리아","크리스탈","엠버","루나","meu"],
    "러블리너스" : ["러블리즈","베이비소울","유지애","서지수","이미주","Kei","JIN","류수정","정예인"],
    "사랑방" : ["SG워너비","이석훈","김진호","김용준"],




    "엘비스" : ["에이오에이","지민","초아","유나","유경","혜정","민아","설현","찬미","elvis"],
    "보이스" : ["씨엔블루","정용화","이종현","강민혁","이정신","Boice"],
    "아가세" : ["갓세븐","JB","마크","잭슨","주니어","영재","뱀뱀","유겸","I Got 7"],
    "카밀리아" : ["카라","박규리","한승연","구하라","허영지"],
    "버디" : ["여자친구","소원","예린","은하","유주","신비","엄지"],
    "하이스쿨" : ["에픽하이","타블로","미쓰라","투컷","high school"],
    "제아스" : ["제국의아이들","문준영","시완","케빈","황광희","김태헌","정희철","하민우","박형식","김동준","ze:a's","ze"],
    "아이코닉" : ["아이콘","B.I","김진환","BOBBY","송윤형","구준회","김동혁","정찬우"],
    "아이엠" : ["투에이엠","조권","임슬옹","정진운","이창민","I am"],
    "레고" : ["이엑스아이디","LE","정화","하니","솔지","혜린"],




    "포니아" : ["포미닛","남지현","허가윤","전지윤","김현아","권소현","4nia"],
    "에버레스팅" : ["브라운아이드걸스","제아","나르샤","미료","가인","everlasting"],
    "소울트리" : ["박효신"],
    "이너써클" : ["위너","강승윤","이승훈","송민호","남태현","김진우"],
    "몬베베" : ["몬스타엑스","주헌","셔누","기현","형원","민혁","원호","아이엠"],
    "세이에이" : ["미쓰에이","지아","민","수지","페이","say a!"],
    "스타일" : ["씨스타","효린","보라","소유","다솜","style"],
    "시크릿타임" : ["시크릿","한선화","송지은","정하나","전효성","secret time"],
    "베스트프랜드" : ["보이프랜드","동현","현성","정민","영민","광민","민우","best friend"],
    "트랙시안" : ["트랙스","제이","김정모","traxian"],





    "퀸즈" : ["티아라","보람","지연","효민","은정","큐리","소연","queen's"],
    "마인" : ["나인뮤지스","혜미","현아","경리","손성아","소진","금조","mine"],
    "캐럿" : ["세븐틴","에스쿱스","정한","조슈아","준","호시","원우","도겸","민규","디에잇","승관","버논","디노","우지"],
    "걸스하이" : ["다비치","이해리","강민경", "girls high"],
    "러브" : ["뉴이스트","JR","Aron","백호","민현","렌","love"],
    "퍼팩션" : ["백퍼센트","혁진","록현","찬용","민우","종환","창범"],
    "컵케익" : ["레드벨벳","웬디","아이린","슬기","조이","예리"],
    "신화창조" : ["신화","김동완","이민우","에릭","앤디","전진","신혜성"],
    "제이워커" : ["박재범","jwalker"],
    "브라이언형나잇" : ["케이윌","kwill"],





    "플레이걸스" : ["에프터스쿨","정아","유이","레이나","나나","리지","이영","가은","play girls"],
    "미라클" : ["오마이걸","효정","진이","미미","유아","승희","지호","비니","아린"],
    "아로하" : ["아스트로","차은우","문빈","MJ","진진","라키","윤산하","aroha"],
    "마이걸" : ["마이네임","세용","인수","준Q","채진","건우", "my girl"],
    "하트라이더" : ["서인국","heart rider"],
    "헬로큐피트" : ["헬로비너스","나라"," 앨리스","라임","유영","서영","여름", "hello cupid"],
    "파인애플" : ["에이프릴","채원","현주","나은","예나","진솔"],
    "원스" : ["트와이스","나연","정연","모모","사나","지효","미나","다현","채영","쯔위"],
    "더블유" : ["더블에이","우상","호익","김치", "double u"],
    "로열패밀리" : ["소년공화국","원준","선우","성준","민수","수웅"],





    "N.Fia" : ["엔플라잉","이승협","권광진","차훈","김재현"],
    "헤브" : ["헤일로","오운","디노","재용","희천","인행","윤동", "have"],
    "트리플S" : ["SS501","김현중","허영생","김규종","박정민","김형준"],
    "키스미" : ["유키스","수현","기섭","일라이","에이제이","훈","케빈","준", "kiss me"],
    "허니텐" : ["업텐션","진후","선율","쿤","웨이","샤오","고결","우신","비토","규진","환희"],
    "스케치북" : ["크레용팝","엘린","소율","금미","초아","웨이"],
    "플라이하이" : ["플라이투더스카이","환희","브라이언","fly high"],
    "트윙즈" : ["테이스티","대룡","소룡"],
    "버스터즈" : ["엠아이비","직 재스퍼","강남","심스","영크림", "busterz"],
    "Fangod" : ["GOD","박준형","데니안","윤계상","손호영","김태우"],






    "레블리" : ["레이디스코드","애슐리","소정","주니","ladies code"],
    "딥스" : ["스피드","신종국","김정우","박세준","김유환","키오"],
    "바닐라" : ["주니엘"],
    "지니" : ["지나"],
    "에얼리언" : ["에일리", "alien"],
    "스토리아" : ["히스토리","송경일","나도균","김시형","김재호","장이정"],
    "각별인" : ["허각"],
    "팬토미즘" : ["팬텀","키겐","한해","산체스"],
    "크라운" : ["씨클라운","롬","시우","레이","강준","티케이","마루"],
    "에이라이트" : ["에이젝스","형곤","윤영","승엽","승진","중희"],





    "달링" : ["달샤벳","세리","아영","우희","수빈","daling"],
    "투포유" : ["투포케이","코리","성오","기수","대일","정욱","진홍","휘","24u"],
    "가족" : ["가비엔제이","제니","건지","서린","family"],
    "베스티니" : ["베스티","혜연","유지","다혜","해령"],
    "미소    " : ["미스터미스터","진","태이","창재","도연","상현","재민"],
    "탑클래스" : ["탑독","P군","제니씨","상도","호준","한솔","제로","비주","낙타","야노","아톰"],
    "레인너스" : ["레인보우","김재경","고우리","김지숙","노을","오승아","정윤혜","조현영"],
    "베베" : ["베베미뇽","벤","박가을","해금"],
    "스플랜드" : ["초신성","윤학","성제","건일","지혁","광수","성모"],
    "렛츠" : ["피에스타","재이","린지","예지","혜미","차오루"],





    "NIZI" : ["클릭비","강후","오종혁","김상혁","우연석","유호석","하현곤","노민혁"],
    "딜메이트" : ["DMTN","장인태","다리","다니엘","동림","사이먼"],
    "솔방울" : ["소나무","수민","민재","디애나","나현","의진","하이디","뉴썬"],
    "힐러" : ["써니힐","주비","승아","코타","미성","hiller"],
    "온리원" : ["빅스타","필독","바람","래환","주드","성학"],
    "라떼" : ["라붐","지엔","소연","해인","유정","솔빈","율희"],
    "레다" : ["레드애플","영준","규민","효석"],
    "트윙클" : ["스텔라","효은","민희","가영","전율","twinkle"],
    "머큐리" : ["스피카","김보아","박시현","양지원","나래","김보형"],
    "알파" : ["알파벳","베타","코드","델타","엡실론","파이","감마","에타","이오타","제타"],




    "바모스" : ["라니아","디","시아","티애","슬지","혜미","알렉산드라"],
    "마스터" : ["대국남아","미카","가람","현민","인준","Jay"],
    "인스윗스로우" : ["스윗스로우","인호진","송우진","김영우","성진환"],
    "키" : ["JJCC","에디","이코","프린스 맥","심바","산청","율","지카","key"],
    "매드피플" : ["매드타운","무스","버피","이건","조타","허준","호","대원"],
    "팅커벨" : ["크나큰","박승준","김유진","김지훈","정인성","오희준"],
    "피프텐" : ["피프틴앤드","박지민","백예린"],
    "수련" : ["백아연"],
    "보석상자" : ["쥬얼리","하주연","박세미","김예원"],
    "런웨이" : ["포커즈","래현","대건","진온","칸","예준", "runWay"],





    "더블링" : ["투엑스","지유","은","수린","은영"],
    "Somuch" : ["가물치","큐","보너스","G.LOW","아토"],
    "버밀리" : ["버스커버스커","장범준","브래드","김형태"],
    "베리베리" : ["베리굿","태하","서율","다예","세형","고운"],
    "뮤즈" : ["엠파이어","제리","루민","태희","유승","하루","레드","티오"],
    "히어로즈" : ["전설","리슨","제혁","로이","리토","창선"],
    "볼러" : ["이블","세이","제이다","쥬시","하야나","율", "Voller"],
    "터치미" : ["터치","성용","재욱","철민","상욱"],
    "매력학과" : ["악동뮤지션","이찬혁","이수현"],
    "와플" : ["와썹","진주","다인","나다","나리","지애","우주","수진"],




    "러브비트" : ["엘씨나인","제이효","라사","킹","아오","준","이든"],
    "피어레스" : ["브레이브걸스","민영","유정","유진","은지","유나","혜란","하윤"],
    "비타밍" : ["밍스","지유","수아","시연","유현","다미"],
    "맵시" : ["엠에이피식스","민혁","싸인","썬","제이빈","제이준"],
    "하프" : ["이하이"],
    "루미넌스" : ["NS윤지"],
    "스메쉬즈" : ["스매쉬","현준","민규","영석","루카스","히로"],
    "트랙" : ["엔트레인","정정균","정승현","송유진","김상우"],
    "미라클" : ["코드브이","재원","솔","상우","나로","루이"],
    "제미니스" : ["주비스","하나","주리"],





    "위드유" : ["트와일라잇","시완","재윤","희천","블랙","티엔","태성","민영"],
    "포라리스" : ["픽스","오송","정욱","누리"],
    "버나드림" : ["버너드박"],
    "포스플로워" : ["포스플로어","손성희","정의준","문상선"],
    "쇼콜라티에" : ["쇼콜라","소아","티아","줄리앤","멜라니"],
    "치와와" : ["치치","샤인","세미","보름","수이","아지"],
    "하이레이디" : ["블레이디","티나","가빈","다영","기루","예은"],
    "러브베이직" : ["지피베이직","에미트","트리니티","자이온","무이"],
    "문라이트" : ["브이에이브이","에이스","바론","제이콥","제한","세인트반","겨울"],
    "큐티" : ["제이큐티","민정","가진","채흔"],






    "러블리" : ["걸스토리","윤정","혜인","유리","채영"],
    "뉴파오" : ["뉴에프오","미마","소이","나래","단아"],
    "씨씨" : ["씨리얼","케미","레디","에피","앤제이"],
    "D.S.F" : ["젝그키스","은지원","이재진","김재덕","강성훈","고지용","장수원"],
    "친구" : ["S.E.S","바다","유진","슈"],
    "핑키" : ["핑클","이효리","성유리","이진","옥주현"],
    "다이아몬드" : ["아이오아이","전소미","김세정","최유정","김청하","김소혜","주결경","정채연","김도연","강미나","임나영","유연정"],

}





var wordToFandom = {};

makeDictionary();
function makeDictionary(){
    var keys = Object.keys(tags);

    for(var i = 0 ; i < keys.length ; i ++){
        var key = keys[i];
        var vals = tags[key];

        for(var j = 0 ; j < vals.length ; j ++){
            var val = vals[j];
            wordToFandom[val] = key;
        }
        wordToFandom[key] = key;
    }
    console.log(wordToFandom);
}
